In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,5,np.nan,6,8]) # Series는 데이터 프레임을 만들어줌
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

## 날짜를 사용한 데이터 프레임 만들기

In [3]:
dates = pd.date_range('20130101',periods = 6) # periods 파라미터는 Dataframe을 만들기 위한 범위를 정해줌
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

## 데이터 크기 정하기

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, # 날짜를 인덱스로 변경함
                 columns = ['A','B','C','D']) # 열의 이름을 정함
# random.randn 는 데이터 프레임의 크기를 정함
df

                   A         B         C         D
2013-01-01  0.361974 -0.150188  0.067820  1.176082
2013-01-02  1.667310 -1.612893 -0.950007 -0.398430
2013-01-03 -1.669064 -0.189778  2.150865 -1.892452
2013-01-04 -1.371999 -0.739354 -0.510013  0.736770
2013-01-05  0.070892  0.944921  0.653458 -0.467449
2013-01-06 -1.183475  0.113190  1.055890  0.049560

In [5]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [7]:
df.values

array([[ 0.36197439, -0.15018769,  0.06781976,  1.17608219],
       [ 1.66731003, -1.61289257, -0.95000721, -0.39843   ],
       [-1.66906369, -0.18977823,  2.15086508, -1.89245164],
       [-1.37199934, -0.73935364, -0.51001268,  0.7367697 ],
       [ 0.0708924 ,  0.94492063,  0.65345791, -0.46744945],
       [-1.18347476,  0.11319006,  1.05589034,  0.04955997]])

In [8]:
df.info() # R에서 str와 같은 기능을 하는 함수

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [10]:
df.describe() # R에서 요약통계량을 보여주는 summary와 같은 기능

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.354060 -0.272350  0.411336 -0.132653
std    1.283167  0.856420  1.124293  1.075314
min   -1.669064 -1.612893 -0.950007 -1.892452
25%   -1.324868 -0.601960 -0.365555 -0.450195
50%   -0.556291 -0.169983  0.360639 -0.174435
75%    0.289204  0.047346  0.955282  0.564967
max    1.667310  0.944921  2.150865  1.176082

In [11]:
df.sort_values(by = 'B',ascending = False) # by 파라미터에 정한 값을 기준으로 정렬함
# ascending은 오름차순으로 정렬함

                   A         B         C         D
2013-01-05  0.070892  0.944921  0.653458 -0.467449
2013-01-06 -1.183475  0.113190  1.055890  0.049560
2013-01-01  0.361974 -0.150188  0.067820  1.176082
2013-01-03 -1.669064 -0.189778  2.150865 -1.892452
2013-01-04 -1.371999 -0.739354 -0.510013  0.736770
2013-01-02  1.667310 -1.612893 -0.950007 -0.398430

In [12]:
df['A'] # 열추출 가능

2013-01-01    0.361974
2013-01-02    1.667310
2013-01-03   -1.669064
2013-01-04   -1.371999
2013-01-05    0.070892
2013-01-06   -1.183475
Freq: D, Name: A, dtype: float64

In [15]:
df[0:3] # slicing기법 가능

                   A         B         C         D
2013-01-01  0.361974 -0.150188  0.067820  1.176082
2013-01-02  1.667310 -1.612893 -0.950007 -0.398430
2013-01-03 -1.669064 -0.189778  2.150865 -1.892452

In [16]:
df['20130102':'20130104'] # 인덱스 이름으로 추출가능

                   A         B         C         D
2013-01-02  1.667310 -1.612893 -0.950007 -0.398430
2013-01-03 -1.669064 -0.189778  2.150865 -1.892452
2013-01-04 -1.371999 -0.739354 -0.510013  0.736770

## loc[] 사용

In [17]:
df.loc[dates[0]]

A    0.361974
B   -0.150188
C    0.067820
D    1.176082
Name: 2013-01-01 00:00:00, dtype: float64

In [18]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.361974 -0.150188
2013-01-02  1.667310 -1.612893
2013-01-03 -1.669064 -0.189778
2013-01-04 -1.371999 -0.739354
2013-01-05  0.070892  0.944921
2013-01-06 -1.183475  0.113190

In [19]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.667310 -1.612893
2013-01-03 -1.669064 -0.189778
2013-01-04 -1.371999 -0.739354

In [21]:
df.loc[dates[0],'A']

0.3619743889211942

## iloc[]사용

In [22]:
df.iloc[3]

A   -1.371999
B   -0.739354
C   -0.510013
D    0.736770
Name: 2013-01-04 00:00:00, dtype: float64

In [24]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.371999 -0.739354
2013-01-05  0.070892  0.944921

In [25]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.667310 -0.950007
2013-01-03 -1.669064  2.150865
2013-01-05  0.070892  0.653458

In [26]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.667310 -1.612893 -0.950007 -0.398430
2013-01-03 -1.669064 -0.189778  2.150865 -1.892452

## 조건문도 사용가능

In [27]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.361974 -0.150188  0.067820  1.176082
2013-01-02  1.667310 -1.612893 -0.950007 -0.398430
2013-01-05  0.070892  0.944921  0.653458 -0.467449

In [28]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.361974       NaN  0.067820  1.176082
2013-01-02  1.667310       NaN       NaN       NaN
2013-01-03       NaN       NaN  2.150865       NaN
2013-01-04       NaN       NaN       NaN  0.736770
2013-01-05  0.070892  0.944921  0.653458       NaN
2013-01-06       NaN  0.113190  1.055890  0.049560

## 원본 데이터를 복사하기

In [29]:
df2 = df.copy()

In [30]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.361974 -0.150188  0.067820  1.176082    one
2013-01-02  1.667310 -1.612893 -0.950007 -0.398430    one
2013-01-03 -1.669064 -0.189778  2.150865 -1.892452    two
2013-01-04 -1.371999 -0.739354 -0.510013  0.736770  three
2013-01-05  0.070892  0.944921  0.653458 -0.467449   four
2013-01-06 -1.183475  0.113190  1.055890  0.049560  three

## isin()함수를 사용해서 데이터에 값이 있는지 확인

In [31]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [32]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.669064 -0.189778  2.150865 -1.892452   two
2013-01-05  0.070892  0.944921  0.653458 -0.467449  four

## apply() 함수 사용

In [33]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.361974 -0.150188  0.067820  1.176082
2013-01-02  2.029284 -1.763080 -0.882187  0.777652
2013-01-03  0.360221 -1.952858  1.268678 -1.114799
2013-01-04 -1.011779 -2.692212  0.758665 -0.378030
2013-01-05 -0.940886 -1.747292  1.412123 -0.845479
2013-01-06 -2.124361 -1.634101  2.468013 -0.795919

In [34]:
df.apply(lambda x: x.max() - x.min())

A    3.336374
B    2.557813
C    3.100872
D    3.068534
dtype: float64

## 데이터 병합하기

In [35]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [36]:
result = pd.concat([df1, df2, df3]) # concat함수는 데이터를 세로로 병합
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [40]:
result = pd.concat([df1, df2, df3], keys=['x', 'y','z']) # keys파라미터를 사용해서 새로운 범주로 나눔
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [38]:
result.index

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           codes=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

## 범주(lebals)확인

In [41]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [42]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [43]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'], 
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])
result = pd.concat([df1, df4], axis=1) # 가로로 합칠때 index의 합집합을 출력하고 만약 인덱스에 해당하는 값이 없으면 NAN을 출력
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [44]:
result = pd.concat([df1, df4], axis=1, join='inner') # index의 교집합만 출력하도록 하는
                                                     # join = 'inner'파라미터
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [45]:
result = pd.concat([df1, df4], axis=1, join_axes=[df1.index]) # 합칠 기준을 설정하는 
                                                              # join_axes = []파라미터
result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [46]:
result = pd.concat([df1, df4], ignore_index=True) # 인덱스를 무시하고 그냥 합침 
                                                   # ignore_index파라미터
result

C:\Users\kimsangho\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

## 데이터 병합하기2

In [47]:
left = pd.DataFrame({'key': ['K0', 'K4', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})